1. Какие из функций округлет число в консоли до 4,7657897335681 двенадцатой цифры ?

     1. round(4,7657897335681, 12)                      +
     2. round(4,7657897335681)
     3. float (4,7657897335681, 12)
     4. float (4,7657897335681)
2. Что выведет операция True + 4 в консоли ?
     
     1. None
     2. Ошибку
     3. True
     4. 5                                     +
     
3. Что выведет программа input() в консоли ?
                         1234 

     1. "1234"                                +
     2. 1234
     
4. Чему равна len('long string') ?
     
     1. 20
     2. 19                                +
     3. 18
     4. 17
     
5. Что нужно вывести после строки tday_ru = 'утро, день, ночь' в консоле, чтобы программа вывела 'т' ?
  
     1. a[1]
     2. tday_ru[1]                                               +                            
     3. [1]
     4. b[1]
     
6. Что выведет программа в консоли? 

   >>> a = b = 1
   >>> a, b
   
     1. 1, 1
     2. (1, 1)                                       +
     3. (1)
     4. 1

7. Какие из перечисленных выражение создадут список из трех элементов ?

     1. list(range(3))
     2. "asd".split()
     3. a = [ 1, 2, 3]
     4 "a b c".split(" ")
     
8. Имеем последоватьность действий :

  >>> a = [1, 2, 3]
  >>> b = [::-1]
  >>> a[0] = 0
  >>> b
  
  Чему равна переменная b ?
  
     1. [3, 2, 1]                                 +
     2. [1, 2, 3]
     3. [0, 2, 3]
     4. [0, 2, 1]
     
9. Что напечатает следущий код ?

print((1, 2, 3) < ( 0, 3, 6))

     1. None
     2. True     
     3. False                                                 +
     4. Ошибка
     
10.  Что напечатает код ?
 
 19 // 3 + 11 // -6
  
     1. 8
     2. 4                              +
     3. 7
     4. 5
 
  
     


     
